#include <Windows.h>

#include <cstdint>

#include "mini_reflection.h"
//#include "binary_serializer.h"
#include "memory_dump.h"

#include <Dbghelp.h>
#include <Windows.h>
#include <objbase.h>

#include <D3D9.h>

#include <array>
#include <charconv>
#include <deque>
#include <iostream>
#include <string>
#include <unordered_map>
#include <unordered_set>
#include <vector>

using mini_reflection::reflect;
using mini_reflection::member_tuple;

using memory_dump::load;
using memory_dump::dump;
using memory_dump::ptr_chain;
using memory_dump::rel_mem_ptr;
using memory_dump::memory_offset;
using memory_dump::local_memory_accessor;
using memory_dump::offset_value;


void* PatchIAT(HMODULE module, void* oldSymbol, void* newSymbol)
{
	ULONG size = 0;
	unsigned char* baseAddress = (unsigned char*)module;
	void* originalSymbol = NULL;

	IMAGE_IMPORT_DESCRIPTOR* importDescriptor = (IMAGE_IMPORT_DESCRIPTOR*)::ImageDirectoryEntryToData(
		baseAddress, TRUE, IMAGE_DIRECTORY_ENTRY_IMPORT, &size);
	if (importDescriptor == NULL)
	{
		//Patching module has no IDT.
		return NULL;
	}

	while (importDescriptor->FirstThunk != 0)
	{
		IMAGE_THUNK_DATA* thunk = (IMAGE_THUNK_DATA*)(baseAddress + importDescriptor->FirstThunk);
		while (thunk->u1.Function != 0)
		{
			if (thunk->u1.Function != (DWORD_PTR)oldSymbol) 
			{
				thunk++;
				continue;
			}

			originalSymbol = (LPVOID)thunk->u1.Function;
			DWORD protect;
			::VirtualProtect(&thunk->u1.Function, sizeof(thunk->u1.Function), PAGE_EXECUTE_READWRITE, &protect);
			thunk->u1.Function = (DWORD_PTR)newSymbol;
			::VirtualProtect(&thunk->u1.Function, sizeof(thunk->u1.Function), protect, &protect);
		}
		importDescriptor++;
	}

	return originalSymbol;
}

template<class F>
F* PatchIAT(LPCSTR symbolModule, LPCSTR symbolName, LPCSTR iatModuleName, F* replacement)
{
	void* import = ::GetProcAddress(::GetModuleHandleA(symbolModule), symbolName);
	if (import == NULL)
		return NULL;

	return (F*)PatchIAT(::GetModuleHandleA(iatModuleName), import, replacement);
}

struct input_data
{
	uint16_t keys[2];
	struct joystick
	{
		uint8_t axes[4];
	} joysticks[4];
	uint32_t unknown[2];
};

char* g_image_base = 0;

void __cdecl get_raw_input_data(input_data* out);
int32_t limit_fps();

typedef struct XACT_WAVE_INSTANCE_PROPERTIES
{
} XACT_WAVE_INSTANCE_PROPERTIES, *LPXACT_WAVE_INSTANCE_PROPERTIES;

DECLARE_INTERFACE(IXACT3Wave)
{
	STDMETHOD(Destroy)(THIS) PURE;
	STDMETHOD(Play)(THIS) PURE;
	STDMETHOD(Stop)(THIS_ DWORD dwFlags) PURE;
	STDMETHOD(Pause)(THIS_ BOOL fPause) PURE;
	STDMETHOD(GetState)(THIS_ __out DWORD* pdwState) PURE;
	STDMETHOD(SetPitch)(THIS_ SHORT pitch) PURE;
	STDMETHOD(SetVolume)(THIS_ FLOAT volume) PURE;
	STDMETHOD(SetMatrixCoefficients)(THIS_ UINT32 uSrcChannelCount, UINT32 uDstChannelCount, __in float* pMatrixCoefficients) PURE;
	STDMETHOD(GetProperties)(THIS_ __out LPXACT_WAVE_INSTANCE_PROPERTIES pProperties) PURE;
};

struct IXACT3WaveBank {};
// IXACT3WaveBank_Play(__in IXACT3WaveBank* pWaveBank, XACTINDEX nWaveIndex, DWORD dwFlags, DWORD dwPlayOffset, XACTLOOPCOUNT nLoopCount, __deref_out IXACT3Wave** ppWave)
int32_t __stdcall play_sound(IXACT3WaveBank*, int16_t, uint32_t, int32_t, int8_t, IXACT3Wave**);
void game_tick();
void __stdcall sleep(uint32_t ms);
const auto sleep_ptr = &sleep;
int __cdecl write_cockpit_font_internal(int x, int y, float z, uint8_t alpha, float scale);
// Wrapper for write_cockpit_font_internal
int write_cockpit_font(const char* buffer, int x, int y, float z, uint8_t alpha, float scale);
void player_status_ticker(const char* message, uint32_t side);
void process_input();
void process_objects();

typedef int (fiber_func_t)();

struct menu_fiber
{
	uint32_t status; // 0
	uint32_t unknown[5]; // 4
	char name[0x18]; // // 18
	fiber_func_t* func;  //30
	LPVOID fiber; // 34
}; // 38

static_assert(sizeof(menu_fiber) == 0x38);

#pragma pack(push, 1)
struct gg_char_state
{
	// common state + char-specific stuff (via union)
	// Doesn't contain any pointers
	// TODO: elaborate later
	char data1[0x7c];
	uint16_t stun_accumulator; // 7c
	uint16_t faint_countdown; // 7e
	char data2[0xc8];
};
#pragma pack(pop)

static_assert(sizeof(gg_char_state) == 0x148);

struct player_button_timers
{
	// Doesn't contain any pointers
	// TODO: elaborate later
	char data[100];
};

struct player_direction_timers
{
	uint32_t timers[2];
#pragma pack(push, 1)
	struct timer
	{
		uint8_t dir;
		uint8_t timer;
	} dir_timers[2][32];
#pragma pack(pop)
	uint32_t dir_timer_idx[2];
};

struct camera_state
{
	// Doesn't contain any pointers
	// TODO: elaborate later
	char data[0xAC];
};

struct extra_config
{
	// Attack/defense/tension rate etc
	// Doesn't contain any pointers
	// TODO: elaborate later
	char data[0x98];
};

struct player_controller_state
{
	// Doesn't contain any pointers
	// TODO: elaborate later
	uint32_t sideswapped;
	char data1[8];
	uint32_t pressed;
	uint32_t depressed;
	char data2[132];
};

struct controller_state
{
	uint32_t bitmask_cur;
	uint32_t bitmask_prev;
	uint32_t bitmask_pressed_prev;
	uint32_t bitmask_pressed_cur;
	uint32_t bitmask_depressed;
	uint32_t timers[16];
	char unused[64];
	bool is_active;
};

static_assert(sizeof(controller_state) == 0x98);

struct mersenne_twister
{
	uint32_t index;
	uint32_t unknown;
	uint64_t data[624];
	bool twist_if_false;
};

static_assert(sizeof(mersenne_twister) == 5008);

struct sprite
{
};

struct hitbox
{
};


#pragma pack(push, 1)
template<size_t Size>
struct data_size
{
	uint8_t data[Size];
};
#pragma pack(pop)

struct active_object_state;
typedef int (palette_reset_func_t)(const active_object_state*);

#pragma pack(push, 1)
struct active_object_state
{
	uint16_t id; // 0
	uint8_t facing; // 2
	uint8_t side; // 3
	active_object_state* prev; // 4
	active_object_state* next; // 8
	uint32_t status_bitmask; // C
	uint32_t unknown_bitmask; // 10
	uint16_t active_move_prev; // 14
	uint16_t pad1; // 16
	uint16_t active_move; // 18
	uint16_t active_move_followup; // 1a
	uint16_t active_move_frame; // 1c
	uint16_t health; // 1e
	active_object_state* other_; // 20
	uint16_t last_jump_dir; // 24
	uint8_t unknown3; // 26
	uint8_t owner_id; // 27
	uint16_t unknown4; // 28
	uint16_t guard_status; // 2A
	gg_char_state* char_state_ptr; // 2C
	void* unknown_callback; // 30
	uint32_t unknown5[2]; // 34
	sprite* sprite_array_a; // 3C
	uint32_t sprite_array_b_idx; // 40
	uint32_t sprite_array_a_idx; // 44
	sprite* sprite_array_b; // 48
	uint32_t unknown6[2]; // 4C
	hitbox* hitbox_array; // 54
	uint32_t unknown7[3]; // 58
	active_object_state* other1; // 64
	uint32_t unknown8; // 68
	active_object_state* other2; // 6C
	uint8_t unknown9[0x14]; // 70
	uint8_t hitbox_count; // 84
	uint8_t unknown99[3]; // 85
	ptr_chain<data_size<0x5c>, 0, 0> data_5c1; // 88
	//data_5c* data_5c1; // 88
	ptr_chain<data_size<0x5c>, 0, 0> data_5c2; // 8C
	//data_5c* data_5c2; // 8C
	void* hit_block_callback; // 90
	palette_reset_func_t* reset_palette_callback; // 94
	uint8_t unknown10[0x14]; // 98
	uint32_t palette_status_bitmask; // ac
	int32_t pos_x; // b0
	int32_t pos_y; // b4
	int32_t velocity_x; // b8
	int32_t velocity_y; // bc
	uint32_t unknown11[8]; // c0
	void* unknown_ptr1; // e0
	uint32_t unknown12[2]; // e4
	void* unknown_ptr2; // ec
	void* unknown_ptr3; // f0
	uint32_t unknown13; // f4
	uint16_t unknown14; // f8
	uint16_t unknown15; // fa
	uint8_t unknown16; // fc
	uint8_t hitstop_countdown; // fd
	uint8_t unknown17[0x32]; // fe - 130
};
#pragma pack(pop)

template<>
struct reflect<active_object_state>
{
	constexpr static auto members = member_tuple(
		&active_object_state::id,
		&active_object_state::facing,
		&active_object_state::side,
		&active_object_state::prev,
		&active_object_state::next,
		&active_object_state::status_bitmask,
		&active_object_state::unknown_bitmask,
		&active_object_state::active_move_prev,
		&active_object_state::pad1,
		&active_object_state::active_move,
		&active_object_state::active_move_followup,
		&active_object_state::active_move_frame,
		&active_object_state::health,
		&active_object_state::other_,
		&active_object_state::last_jump_dir,
		&active_object_state::unknown3,
		&active_object_state::owner_id,
		&active_object_state::unknown4,
		&active_object_state::guard_status,
		&active_object_state::char_state_ptr,
		&active_object_state::unknown_callback,
		&active_object_state::unknown5,
		&active_object_state::sprite_array_a,
		&active_object_state::sprite_array_b_idx,
		&active_object_state::sprite_array_a_idx,
		&active_object_state::sprite_array_b,
		&active_object_state::unknown6,
		&active_object_state::hitbox_array,
		&active_object_state::unknown7,
		&active_object_state::other1,
		&active_object_state::unknown8,
		&active_object_state::other2,
		&active_object_state::unknown9,
		&active_object_state::hitbox_count,
		&active_object_state::unknown99,
		&active_object_state::data_5c1,
		&active_object_state::data_5c2,
		&active_object_state::hit_block_callback,
		&active_object_state::reset_palette_callback,
		&active_object_state::unknown10,
		&active_object_state::palette_status_bitmask,
		&active_object_state::pos_x,
		&active_object_state::pos_y,
		&active_object_state::velocity_x,
		&active_object_state::velocity_y,
		&active_object_state::unknown11,
		&active_object_state::unknown_ptr1,
		&active_object_state::unknown12,
		&active_object_state::unknown_ptr2,
		&active_object_state::unknown_ptr3,
		&active_object_state::unknown13,
		&active_object_state::unknown14,
		&active_object_state::unknown15,
		&active_object_state::unknown16,
		&active_object_state::hitstop_countdown,
		&active_object_state::unknown17
	);
};

//static_assert(sizeof(active_object_state) == 0x130);

struct projectiles
{
	active_object_state objects[0x80];
};

template<>
struct reflect<projectiles>
{
	constexpr static auto members = member_tuple(
		&projectiles::objects
	);
};

struct directx_obj
{
	ptr_chain<data_size<0x20>, 0, 0> vtable1;
	ptr_chain<data_size<0x20>, 0, 0> vtable2;
	directx_obj* ptr1;
	directx_obj* ptr2;
	uint32_t idx1;
	uint32_t idx2;
};

template<>
struct reflect<directx_obj>
{
	constexpr static auto members = member_tuple(
		&directx_obj::vtable1,
		&directx_obj::vtable2,
		&directx_obj::ptr1,
		&directx_obj::ptr2,
		&directx_obj::idx1,
		&directx_obj::idx2
	);
};

struct match_state
{
	memory_offset<uint8_t, 0x50f7ec> p1_rounds_won;
	memory_offset<uint8_t, 0x50f7ed> p2_rounds_won;
	memory_offset<uint32_t, 0x50f7fc> round_end_bitmask;
	memory_offset<uint16_t, 0x50F800> match_countdown;
	memory_offset<uint8_t, 0x5113C0> round_state;
	memory_offset<gg_char_state[2], 0x51A038> character_state;
	memory_offset<camera_state, 0x51B0D4> camera_state;
	memory_offset<player_button_timers, 0x516010> player_button_timers;
	memory_offset<player_direction_timers, 0x5161f8> player_direction_timers;
	memory_offset<player_controller_state[2], 0x516294> player_controller_state;
	memory_offset<uint8_t, 0x51B814> p1_selected_palette;
	memory_offset<uint8_t, 0x51B816> p2_selected_palette;
	// TODO: ac / gg / ggx
	memory_offset<bool, 0x51B8F8> p1_ex_enabled;
	memory_offset<bool, 0x51B8FC> p2_ex_enabled;
	// There are actually 4 controllers, but 3-4 are copies of 2
	memory_offset<controller_state[2], 0x51EDC8> controller_state;
	memory_offset<uint8_t[0x24], 0x519E50> extra_objects_meta;
	// TODO: optimize by capturing only objects in use
	// active_object_state[0x‭17F‬]
	memory_offset<ptr_chain<data_size<0x130 * 0x17F>, 0, 0>, 0x519E50> extra_objects;
	memory_offset<ptr_chain<active_object_state, 0, 0>, 0x516778> p1_character;
	memory_offset<ptr_chain<active_object_state, 0, 0>, 0x51A07C> p2_character;
	memory_offset<ptr_chain<projectiles, 0, 0>, 0x51677C> projectiles;

	// TODO: shorten / split this monstrosity
	memory_offset<uint8_t[0x7E7D], 0x4FDC00> training_mode_history;

	memory_offset<uint32_t, 0x555FEC> pause_state;

	memory_offset<uint8_t[0x90], 0x50AA0C> extra_rng_state;

	// TODO: try to shorten / remove some of this stuff
	memory_offset<uint8_t, 0x505A7D> graphics1;
	memory_offset<uint32_t, 0x506558> graphics2;
	memory_offset<uint32_t, 0x506588> graphics3;
	memory_offset<uint32_t, 0x506690> graphics4;
	memory_offset<uint32_t, 0x506694> graphics5;
	memory_offset<uint32_t, 0x506698> graphics6;
	memory_offset<uint32_t, 0x5066B0> graphics7;
	memory_offset<uint32_t, 0x5066B4> graphics8;
	memory_offset<uint8_t[0x8FA8], 0x521268> graphics9;
	memory_offset<uint32_t, 0x5476E8> graphics10;
	memory_offset<ptr_chain<data_size<0x19D78>, 0, 0>, 0x5480F0> graphics11;
	memory_offset<uint32_t, 0x548104> graphics12;
	memory_offset<uint32_t, 0x5489E0> graphics13;
	memory_offset<uint32_t, 0x5489F0> graphics14;
	memory_offset<uint32_t, 0x5489F8> graphics15;
	memory_offset<uint32_t, 0x55607C> graphics16;
	memory_offset<uint32_t, 0x55609C> graphics17;
	memory_offset<uint32_t, 0x5560A0> graphics18;
	memory_offset<uint8_t[0x1348], 0x548A00> graphics19;
	memory_offset<uint8_t[0x1CFC], 0x54B200> graphics20;
	
	// TODO: remove as much as possible of these 'unknown' values in the future
	memory_offset<uint32_t, 0x3E37FC> unknown1;
	memory_offset<uint32_t, 0x4F80E4> unknown2;
	memory_offset<uint32_t, 0x5113B4> unknown3;
	memory_offset<active_object_state, 0x517BA8> unknown4;
	memory_offset<uint32_t, 0x51B798> unknown5;
	memory_offset<uint32_t, 0x51B7A4> unknown6;
	memory_offset<uint32_t, 0x51B914> unknown7;
	memory_offset<uint32_t, 0x51B9DC> unknown8;
	memory_offset<uint32_t, 0x51EDD4> unknown9;
	memory_offset<uint32_t, 0x51EE6C> unknown10;
	memory_offset<uint32_t, 0x51EF04> unknown11;
	memory_offset<uint32_t, 0x51EF9C> unknown12;
	memory_offset<uint32_t, 0x555D28> unknown13;
	memory_offset<uint32_t, 0x55602C> unknown14;
	memory_offset<uint32_t, 0x5561A8> unknown15;
	memory_offset<active_object_state, 0x517A78> unknown16;
	memory_offset<uint8_t[0x2800], 0x5489F8> unknown17;
	memory_offset<uint8_t[0x2800], 0x54B198> unknown18;
	memory_offset<uint8_t[0x54], 0x506690> unknown19;
	memory_offset<ptr_chain<data_size<0x1CFF0>, 0, 0>, 0x5066A4> unknown20;
	memory_offset<ptr_chain<data_size<0x1CFF0>, 0, 0>, 0x5066A8> unknown21;
	memory_offset<active_object_state, 0x5163E0> unknown22;
};

static_assert(sizeof(player_controller_state) == 152);
static_assert(sizeof(match_state().player_direction_timers.get()) == 144);

template<>
struct reflect<match_state>
{
	constexpr static auto members = member_tuple(
		&match_state::p1_rounds_won,
		&match_state::p2_rounds_won,
		&match_state::round_end_bitmask,
		&match_state::match_countdown,
		&match_state::round_state,
		&match_state::character_state,
		&match_state::camera_state,
		&match_state::player_button_timers,
		&match_state::player_direction_timers,
		&match_state::p1_selected_palette,
		&match_state::p2_selected_palette,
		&match_state::p1_ex_enabled,
		&match_state::p2_ex_enabled,
		&match_state::controller_state,
		&match_state::extra_objects_meta,
		&match_state::extra_objects,
		&match_state::p1_character,
		&match_state::p2_character,
		&match_state::projectiles,
		&match_state::training_mode_history,
		&match_state::pause_state,
		&match_state::extra_rng_state,

		&match_state::graphics1,
		&match_state::graphics2,
		&match_state::graphics3,
		&match_state::graphics4,
		&match_state::graphics5,
		&match_state::graphics6,
		&match_state::graphics7,
		&match_state::graphics8,
		&match_state::graphics9,
		&match_state::graphics10,
		&match_state::graphics11,
		&match_state::graphics12,
		&match_state::graphics13,
		&match_state::graphics14,
		&match_state::graphics15,
		&match_state::graphics16,
		&match_state::graphics17,
		&match_state::graphics18,
		&match_state::graphics19,
		&match_state::graphics20,

		&match_state::unknown1,
		&match_state::unknown2,
		&match_state::unknown3,
		&match_state::unknown4,
		&match_state::unknown5,
		&match_state::unknown6,
		&match_state::unknown7,
		&match_state::unknown8,
		&match_state::unknown9,
		&match_state::unknown10,
		&match_state::unknown11,
		&match_state::unknown12,
		&match_state::unknown13,
		&match_state::unknown14,
		&match_state::unknown15,
		&match_state::unknown16,
		&match_state::unknown17,
		/*&match_state::unknown18,
		&match_state::unknown19,
		&match_state::unknown20,
		&match_state::unknown21,*/
		&match_state::unknown22
	);
};

#pragma pack(push, 1)
struct game_config
{
	struct controller_config
	{
		struct bitmask
		{
			uint16_t bit;
			uint16_t pad;
		};
		static constexpr bitmask up = {0x10};
		static constexpr bitmask down = {0x40};
		static constexpr bitmask left = {0x80};
		static constexpr bitmask right = {0x20};
		bitmask p; // 0
		bitmask k; // 4
		bitmask s; // 8
		bitmask hs; // c
		bitmask d; // 10
		bitmask taunt; // 14
		bitmask reset; // 18
		bitmask pause; // 1c
		bitmask rec_player; // 20
		bitmask rec_enemy; // 24
		bitmask play_memory; // 28
		bitmask switch_control; // 2c
		bitmask enemy_walk; //30
		bitmask enemy_jump; // 34
		bitmask pk; // 38
		bitmask pd; // 3c
		bitmask pks; // 40
		bitmask pksh; // 44
		// 1-4, 0=controller, 5=custom
		uint32_t preset_id; // 48
		uint32_t unknown2; // 4c
	};
	controller_config player_controller_config[2];
	controller_config controller_config_presets[4];

	uint8_t unknown[0x2948];
};
#pragma pack(pop)

static_assert(sizeof(game_config::controller_config) == 0x50);
static_assert(sizeof(game_config) == 0x2b28);

uint16_t reverse_bytes(uint16_t value)
{
	return value / 256 + (value & 0xff) * 256;
}

enum class fiber_id : uint32_t
{
	none1 = 0,
	none2 = 0xa,
	title = 9,
	movie = 45,
	main_menu = 0x19,
	charselect = 0xf
};

enum class main_menu_idx : uint32_t
{
	training = 7
};

struct gg_state
{
	// TODO: memory_offset => external
	// TODO: remove rel_mem_ptr altogether
	memory_offset<rel_mem_ptr<decltype(game_tick)>, 0x14756E + 1> game_tick;
	memory_offset<rel_mem_ptr<decltype(process_input)>, 0x146F95 + 1> process_input;
	memory_offset<rel_mem_ptr<decltype(get_raw_input_data)>, 0x5263d + 1> get_raw_input_data;
